#获取键盘上输入的数据  input(....)  键盘上输入的数据都是字符串类型
# name = input("请输入您的姓名: ")
# age = input("请输入您的年龄: ")
#
# print(f"您的姓名是: {name}您的年龄是: {age}")

# #案例: 银行卡取款
# #总金额
# total = 10000
#
# #输入密码
# password = input("请输入您的银行卡密码:   ")
# print (f"密码输入正确,{password}")
#
# #输入取款金额
# num = input("请输入您的取款金额  ")
#
# #计算余额并取出 ---------> num需要转为int类型 -------->int(......)
# print (f"取款后银行卡余额为: {total - int(num)}")

# 练习: 根据用户输入的两个数字,计算两个数之和,并将其输出到控制台
s1 = input("请输入求和的第一个数: ")
s2 = input("请输入求和的第二个数: ")

print (f"这两个数之和是:   {int(s1)+int(s2)}")