#1. 算术运算符 + - * / // % **
#算数运算符的优先级 ---> ** -> * / //（求模值） %（取余值） -> + -,可用括号提高优先级

#案例 输出x+y x-y
# x = float (input("请输入x的值： "))
# y = float (input("请输入y的值： "))
#
# print ("x + y = ", x + y)
# print ("x - y = ", x - y) #精度会出现损失（二进制无法准确表示所有小数，涉及到浮点数的计算可能会损失精度）

#2. 赋值运算符 = += -= *= /= //= %= **=(中间不要加空格)
#例： num += 2 ----------->num = num + 2      其他的与之类似

#3. 比较运算符----------> 比较两个数值的关系并输出一个布尔值
#== （等于，判断a与b是否相等）  != (不等于)  >(大于)  >=(大于等于)  <(小于)  <=(小于等于)

#4. 逻辑运算符 连接多个布尔表达式,并且返回一个布尔类型值
#且----->and   或---------->or  非--------->not

#案例1:   键盘输入一个整数,判断这个数字是否在10-20之间
#输入整数
num = int(input("请输入一个整数: "))
print(10 <= num <= 20)

#案例2:   键盘输入一个整数,判断这个数字是否不在10-20之间
num = int(input("请输入一个整数: "))
print(not(10 <= num <= 20))
